Repository: thamushadowz/mahall_manager
Catalog: lib/l10n/app_*.arb
Languages: ml

source: Login
ml: ലോഗിൻ

source: Login
ml: തുടരുക

source: Mobile No
ml: മൊബൈൽ നമ്പർ

source: Password
ml: പാസ്സ്‌വേർഡ്

# login_desc
source: Please enter your credentials below.
ml: ദയവായി നിങ്ങളുടെ വിവരങ്ങൾ താഴെ നൽകുക.

source: Forgot password?
ml: പാസ്സ്‌വേർഡ് മറന്നോ?

source: Reset now
ml: ഇപ്പോൾ പുനഃസജ്ജമാക്കുക

# mobile_reqd
source: Mobile number is required
ml: മൊബൈൽ നമ്പർ ആവശ്യമാണ്

# enter_valid_mobile_no
source: Enter a valid 10-digit mobile number
ml: സാധുവായ 10 അക്ക മൊബൈൽ നമ്പർ നൽകുക

# password_reqd
source: Password is required
ml: പാസ്സ്‌വേർഡ് ആവശ്യമാണ്

# password_must_long
source: Password must be at least 8 characters long
ml: പാസ്സ്‌വേർഡിനു കുറഞ്ഞത് 8 അക്കങ്ങൾ ഉണ്ടായിരിക്കണം

# incorrect_mobile_or_password
source: Mobile number or Password is incorrect
ml: മൊബൈൽ നമ്പറോ പാസ്സ്‌വേർഡോ തെറ്റാണ്

# login_success
source: Login successful
ml: ലോഗിൻ വിജയകരം

source: Registration
ml: രജിസ്ട്രേഷൻ

source: User Registration
ml: യൂസർ രജിസ്ട്രേഷൻ

# reg_no
source: Register Number
ml: രജിസ്റ്റർ നമ്പർ

source: First Name
ml: ആദ്യ നാമം

source: Last Name
ml: അവസാന നാമം

source: House Name
ml: വീട്ടു പേര്

source: Place
ml: സ്ഥലം

source: Gender
ml: ലിംഗം

source: Age
ml: വയസ്സ്

# dob
source: Date of Birth
ml: ജനനത്തീയതി

source: Job
ml: ജോലി

# income
source: Annual Income
ml: വാർഷിക വരുമാനം

source: Blood Group
ml: രക്ത ഗ്രൂപ്പ്

# pending_amt
source: Pending Amount
ml: ശേഷിക്കുന്ന തുക

# is_expat
source: Is Expat (Pravasi) ?
ml: പ്രവാസി ആണോ?

source: Country
ml: രാജ്യം

source: Submit
ml: സമർപ്പിക്കുക

source: Male
ml: പുരുഷൻ

source: Female
ml: സ്‌ത്രീ

source: Others
ml: മറ്റുള്ളവ

# a_pos
source: A positive (A+)
ml: A പോസിറ്റീവ് (A+)

# a_neg
source: A negative (A-)
ml: A നെഗറ്റീവ് (A-)

# b_pos
source: B positive (B+)
ml: B പോസിറ്റീവ് (B+)

# b_neg
source: B negative (B-)
ml: B നെഗറ്റീവ് (B-)

# ab_pos
source: AB positive (AB+)
ml: AB പോസിറ്റീവ് (AB+)

# ab_neg
source: AB negative (AB-)
ml: AB നെഗറ്റീവ് (AB-)

# o_pos
source: O positive (O+)
ml: O പോസിറ്റീവ് (O+)

# o_neg
source: O negative (O-)
ml: O നെഗറ്റീവ് (O-)

# below_lakh
source: Below 1 Lakh
ml: ഒരു ലക്ഷത്തിൽ താഴെ

# one_to_two_nine_lakh
source: 1,00,000 to 2,99,999 Lakhs
ml: 1,00,000 മുതൽ 2,99,999 ലക്ഷം വരെ

# three_to_four_nine_lakh
source: 3,00,000 to 4,99,999 Lakhs
ml: 3,00,000 മുതൽ 4,99,999 ലക്ഷം വരെ

# five_to_six_nine_lakh
source: 5,00,000 to 6,99,999 Lakhs
ml: 5,00,000 മുതൽ 6,99,999 ലക്ഷം വരെ

# seven_to_eight_nine_lakh
source: 7,00,000 to 8,99,999 Lakhs
ml: 7,00,000 മുതൽ 8,99,999 ലക്ഷം വരെ

# nine_to_nine_nine_lakh
source: 9,00,000 to 9,99,999 Lakhs
ml: 9,00,000 മുതൽ 9,99,999 ലക്ഷം വരെ

# above_ten_lakh
source: 10 Lakhs and above
ml: 10 ലക്ഷവും അതിൽ കൂടുതലും

# reg_no_reqd
source: Register number required
ml: രജിസ്റ്റർ നമ്പർ ആവശ്യമാണ്

# fname_reqd
source: First name required
ml: ആദ്യ നാമം ആവശ്യമാണ്

# lname_reqd
source: Last name required
ml: അവസാന നാമം ആവശ്യമാണ്

# house_name_reqd
source: House name required
ml: വീട്ടുപേര് ആവശ്യമാണ്

# place_reqd
source: Place required
ml: സ്ഥലപ്പേര് ആവശ്യമാണ്

# gender_reqd
source: Gender required
ml: ലിംഗഭേദം ആവശ്യമാണ്

# age_reqd
source: Age required
ml: പ്രായം ആവശ്യമാണ്

# age_invalid
source: Age should be between 1 and 130
ml: പ്രായം 1 നും 130 നും ഇടയിൽ ആയിരിക്കണം

# job_reqd
source: Job required
ml: ജോലി ആവശ്യമാണ്

# income_reqd
source: Income required
ml: വരുമാനം ആവശ്യമാണ്

# blood_reqd
source: Blood group required
ml: രക്തഗ്രൂപ്പ് ആവശ്യമാണ്

# country_reqd
source: Country required
ml: രാജ്യം ആവശ്യമാണ്

# district_reqd
source: District required
ml: ജില്ല ആവശ്യമാണ്

# state_reqd
source: State required
ml: സംസ്ഥാനം ആവശ്യമാണ്

# house_holder_name_reqd
source: Householder name required
ml: ഗൃഹനാഥന്റെ പേര് ആവശ്യമാണ്

# mahall_name_reqd
source: Mahall name required
ml: മഹല്ലിന്റെ പേര് ആവശ്യമാണ്

# password_mismatch
source: Password Mismatch!! Please check the password
ml: പാസ്സ്‌വേർഡ് പൊരുത്തക്കേട്!! ദയവായി പാസ്‌വേഡ് പരിശോധിക്കുക

# password_must_different
source: New password must be different from current password
ml: പുതിയ പാസ്‌വേഡ് നിലവിലെ പാസ്‌വേഡിൽ നിന്ന് വ്യത്യസ്തമായിരിക്കണം

source: Thank You
ml: നന്ദി

# user_reg_success
source: User registration successful
ml: ഉപയോക്തൃ രജിസ്ട്രേഷൻ വിജയകരം

# house_reg_success
source: House registration successful
ml: വീട് രജിസ്ട്രേഷൻ വിജയകരം

source: Register another
ml: മറ്റൊന്ന് രജിസ്റ്റർ ചെയ്യുക

source: or
ml: അല്ലെങ്കിൽ

source: Go Home
ml: ഹോം സ്ക്രീൻ

source: Committee Registration
ml: കമ്മിറ്റി രജിസ്ട്രേഷൻ

source: President
ml: പ്രസിഡൻ്റ്

source: Secretary
ml: സെക്രട്ടറി

source: Treasurer
ml: ട്രഷറർ

source: House Registration
ml: വീട് രജിസ്ട്രേഷൻ

source: Householder Name
ml: ഗൃഹനാഥന്റെ പേര്

source: Mahall Name
ml: മഹല്ലിന്റെ പേര്

source: District
ml: ജില്ല

source: Alappuzha
ml: ആലപ്പുഴ

source: Ernakulam
ml: എറണാകുളം

source: Idukki
ml: ഇടുക്കി

source: Kannur
ml: കണ്ണൂർ

source: Kasaragod
ml: കാസർകോട്

source: Kollam
ml: കൊല്ലം

source: Kottayam
ml: കോട്ടയം

source: Kozhikode
ml: കോഴിക്കോട്

source: Malappuram
ml: മലപ്പുറം

source: Palakkad
ml: പാലക്കാട്

source: Pathanamthitta
ml: പത്തനംതിട്ട

source: Thiruvananthapuram
ml: തിരുവനന്തപുരം

source: Thrissur
ml: തൃശൂർ

source: Wayanad
ml: വയനാട്

source: Delete
ml: നീക്കംചെയ്യുക

source: Cancel
ml: ഉപേക്ഷിക്കുക

source: Are you sure to delete?
ml: നീക്കം ചെയ്യണമെന്ന് ഉറപ്പാണോ?

source: State
ml: സംസ്ഥാനം

source: Reset Password
ml: പാസ്സ്‌വേർഡ് മാറ്റുക

source: Current Password
ml: നിലവിലെ പാസ്സ്‌വേർഡ്

source: New Password
ml: പുതിയ പാസ്സ്‌വേർഡ്

source: Confirm Password
ml: പാസ്സ്‌വേർഡ് സ്ഥിരീകരിക്കുക

# password_reset_success
source: Password reset successful
ml: പാസ്സ്‌വേർഡ് മാറ്റൽ വിജയകരം
